OpenFOAM-11/tutorials/shockFluid/shockTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          shockFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.007;

deltaT          5e-6;

writeControl    adjustableRunTime;

writeInterval   0.001;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.1;

maxDeltaT       1;

functions
{
    #includeFunc mag(U)
}

// ************************************************************************* //
